test-results/owsaggregate3.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
metadata,232,149,127,183,243,461,115,785,0.000%,.38862,0.49,0.14
placements,232,890,858,1016,1068,1291,792,1346,0.000%,.38835,1.88,0.16
source-of-streams,231,591,614,788,918,1210,279,1683,0.000%,.38971,0.27,0.15
streams-breakdown,231,399,320,647,705,877,284,2318,0.000%,.38970,0.56,0.15
streams,231,517,452,712,778,1391,395,1920,0.000%,.38962,8.23,0.14
downloads,231,379,317,538,658,1144,278,2173,0.000%,.38971,2.42,0.14
playlists,231,599,526,879,1071,1189,459,1682,0.000%,.38973,1.14,0.15
top-countries-streams,231,578,608,750,866,1637,276,2663,0.000%,.38966,3.05,0.15
top-countries-downloads,231,377,312,609,653,1098,270,1948,0.000%,.38967,1.43,0.15
demographics,231,361,317,554,620,758,273,1253,0.000%,.38968,0.22,0.15
top-sound-recordings,231,368,309,612,706,882,271,1177,0.000%,.38969,0.82,0.14
recent-placements,231,1353,1283,1578,1761,2343,1168,2813,0.000%,.38922,3.46,0.14
feeds,229,426,416,602,692,1015,98,1597,0.000%,.38836,1.07,0.13
product,229,555,511,609,819,1335,449,1781,0.000%,.38845,0.51,0.14
product-metadata,229,176,128,412,447,549,117,731,0.000%,.38875,0.72,0.14
TOTAL,3461,515,429,925,1252,1574,98,2813,0.000%,5.78285,26.02,2.14